app/Models/CarrosModel.php

SELECT *
FROM `tb_carros`
---
    public function getCarros(){
        return $this->findAll();