app/Models/PessoasModel.php

SELECT *
FROM `tb_pessoas`
---
    public function getPessoas(){
        return $this->findAll();